nxp-mcuxpresso/mcux-sdk-examples/rdrw612bga/driver_examples/dmic/dmic_i2s_dma/pin_mux.c
/*
 * Copyright 2024 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: RW612
package_id: RW612ETA2I
mcu_data: ksdk2_0
processor_version: 0.16.10
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_io_mux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: E5, peripheral: FLEXCOMM3, signal: USART_RXD, pin_signal: GPIO_24}
  - {pin_num: M6, peripheral: FLEXCOMM1, signal: I2S_WS, pin_signal: GPIO_8}
  - {pin_num: L9, peripheral: FLEXCOMM1, signal: I2S_SCK, pin_signal: GPIO_7}
  - {pin_num: M4, peripheral: FLEXCOMM1, signal: I2S_DATA, pin_signal: GPIO_9}
  - {pin_num: L11, peripheral: DMIC0, signal: 'CLK, 0_1', pin_signal: GPIO_53}
  - {pin_num: M10, peripheral: DMIC0, signal: 'CLK, 2_3', pin_signal: GPIO_54}
  - {pin_num: M8, peripheral: DMIC0, signal: 'DATA, 0_1', pin_signal: GPIO_51}
  - {pin_num: K8, peripheral: DMIC0, signal: 'DATA, 2_3', pin_signal: GPIO_52}
  - {pin_num: L7, peripheral: CLKCTL1, signal: MCLK, pin_signal: GPIO_5}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : 
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* Initialize FC1_I2S functionality on pin GPIO_8, GPIO_7, GPIO_9 (pin M6_L9_M4) */
    IO_MUX_SetPinMux(IO_MUX_FC1_I2S);
    /* Initialize FC3_USART_DATA functionality on pin GPIO_24 (pin E5) */
    IO_MUX_SetPinMux(IO_MUX_FC3_USART_DATA);
    /* Initialize PDM functionality on pin GPIO_53, GPIO_54, GPIO_51, GPIO_52 (pin L11_M10_M8_K8) */
    IO_MUX_SetPinMux(IO_MUX_PDM);
    /* Initialize MCLK functionality on pin GPIO_5 (pin L7) */
    IO_MUX_SetPinMux(IO_MUX_MCLK);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI2CPinsAsGPIO:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: J3, peripheral: GPIO, signal: 'PIO0, 16', pin_signal: GPIO_16}
  - {pin_num: H2, peripheral: GPIO, signal: 'PIO0, 17', pin_signal: GPIO_17}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI2CPinsAsGPIO
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitI2CPinsAsGPIO(void)
{
    /* Initialize GPIO16 functionality on pin GPIO_16, GPIO_17 (pin J3_H2) */
    IO_MUX_SetPinMux(IO_MUX_GPIO16);
    /* Initialize GPIO17 functionality on pin GPIO_17, GPIO_16 (pin H2_J3) */
    IO_MUX_SetPinMux(IO_MUX_GPIO17);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI2CPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: J3, peripheral: FLEXCOMM2, signal: I2C_SDA, pin_signal: GPIO_16}
  - {pin_num: H2, peripheral: FLEXCOMM2, signal: I2C_SCL, pin_signal: GPIO_17}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI2CPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitI2CPins(void)
{
    /* Initialize FC2_I2C_16_17 functionality on pin GPIO_16, GPIO_17 (pin J3_H2) */
    IO_MUX_SetPinMux(IO_MUX_FC2_I2C_16_17);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
